FemDesign.RestrictedDouble
Contains double restrictions used for property definitions.
Restrictions are defined by strusoft.xsd

FemDesign.RestrictedDouble.ValueInRange(System.Double,System.Double,System.Double)
Check if val in range (min, max)

FemDesign.RestrictedDouble.Positive(System.Double)
Check if val is positive

FemDesign.RestrictedDouble.AbsMax_1000(System.Double)
abs_max_1000

FemDesign.RestrictedDouble.AbsMax_10000(System.Double)
abs_max_10000

FemDesign.RestrictedDouble.NonNegMax_1(System.Double)
non_neg_max_1, position_type, reduction_factor_type, orthotropy_type

FemDesign.RestrictedDouble.NonNegMax_10(System.Double)
non_neg_max_10

FemDesign.RestrictedDouble.NonNegMax_1000(System.Double)
non_neg_max_1000

FemDesign.RestrictedDouble.NonNegMax_10000(System.Double)
non_neg_max_10000

FemDesign.RestrictedDouble.NonNegMax_1e5(System.Double)
non_neg_max_1e15

FemDesign.RestrictedDouble.NonNegMax_1e10(System.Double)
non_neg_max_1e10

FemDesign.RestrictedDouble.NonNegMax_1e15(System.Double)
non_neg_max_1e15

FemDesign.RestrictedDouble.NonNegMax_1e20(System.Double)
non_neg_max_1e20

FemDesign.RestrictedDouble.NonNegMax_1e30(System.Double)
non_neg_max_1e30

FemDesign.RestrictedDouble.MaterialBaseValue(System.Double)
material_base_value

FemDesign.RestrictedDouble.MaterialNuValue(System.Double)
material_nu_value

FemDesign.RestrictedDouble.OneQuadrantRadians(System.Double)
one_quadrant

FemDesign.RestrictedDouble.OneQuadrantDegrees(System.Double)
one_quadrant, degree specific

FemDesign.RestrictedDouble.TwoQuadrantsRadians(System.Double)
two_quadrants

FemDesign.RestrictedDouble.TwoQuadrantsDegrees(System.Double)
two_quadrants, degree specific

FemDesign.RestrictedDouble.AbsTwoQuadrants(System.Double)
abs_two_quadrants

FemDesign.RestrictedDouble.PositionType(System.Double)
position_type

FemDesign.RestrictedDouble.RcDiameterValue(System.Double)
rc_diameter_value

FemDesign.RestrictedDouble.RcKValue(System.Double)
rc_k_value

FemDesign.RestrictedDouble.TimberPanelThickness(System.Double)
timber_panel_thickness